# Groupby Object in pandas

### Key concept of groupby: 
-> Split-Apply-Combine: The core concept behind groupby.
 - Split: Splitting the data into groups based on some criteria.
 - Apply: Applying a function to each group independently.
 - Combine: Combining the results into a data structure.

In [2]:
import pandas as pd
import numpy as np

In [3]:
data1 = pd.read_csv('StudentsPerformance.csv')

In [4]:
data1.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [5]:
data1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   gender                       1000 non-null   object
 1   race/ethnicity               1000 non-null   object
 2   parental level of education  1000 non-null   object
 3   lunch                        1000 non-null   object
 4   test preparation course      1000 non-null   object
 5   math score                   1000 non-null   int64
 6   reading score                1000 non-null   int64
 7   writing score                1000 non-null   int64
dtypes: int64(3), object(5)
memory usage: 62.6+ KB

In [6]:
data1.rename(columns={'race/ethnicity':'groups'},inplace=True)

In [ ]:
groups = data1.groupby('groups') # This creates a groupby object named groups

In [ ]:
print(groups) # Address of the group..

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x0000022380E46C30>

In [10]:
type(groups)

pandas.core.groupby.generic.DataFrameGroupBy

In [ ]:
for i,j in groups: # This way can be used to print that group data.. because it stores similiar as dictionary.
    # print(i,j)
    # print(type(i))
    # print(type(j))
    break

     gender   groups parental level of education         lunch  \
3      male  group A          associate's degree  free/reduced
13     male  group A                some college      standard
14   female  group A             master's degree      standard
25     male  group A             master's degree  free/reduced
46   female  group A          associate's degree      standard
..      ...      ...                         ...           ...
974  female  group A                some college      standard
983  female  group A                some college      standard
985    male  group A                 high school      standard
988  female  group A            some high school  free/reduced
994    male  group A                 high school      standard

    test preparation course  math score  reading score  writing score
3                      none          47             57             44
13                completed          78             72             70
14                     none          50             53             58
25                     none          73             74             72
46                completed          55             65             62
..                      ...         ...            ...            ...
974                    none          54             63             67
983               completed          78             87             91
985                    none          57             51             54
988                    none          44             45             45
994                    none          63             63             62

[89 rows x 8 columns]

## Aggregation
-> Common aggregation functions:
 - sum()
 - mean()
 - count()
 - min()
 - max()
 - std() (standard deviation)
 - var() (variance)

-> Custom aggregation using agg() or aggregate()

-> Named aggregation (defining multiple aggregation operations at once)

In [ ]:
# sum()
groups.sum()

,gender,parental level of education,lunch,test preparation course,math score,reading score,writing score
groups,,,,,,,
group A,malemalefemalemalefemalemalemalefemalemalemale...,associate's degreesome collegemaster's degreem...,free/reducedstandardstandardfree/reducedstanda...,nonecompletednonenonecompletednonenonenonecomp...,5485,5756,5578
group B,femalefemalefemalefemalemalefemalefemalefemale...,bachelor's degreemaster's degreeassociate's de...,standardstandardstandardstandardfree/reducedfr...,nonenonenonecompletednonenonenonenonecompleted...,12056,12797,12464
group C,femalemalemalefemalemalemalefemalefemalefemale...,some collegesome collegeassociate's degreesome...,standardstandardstandardstandardstandardfree/r...,completednonenonenonenonecompletednonenonenone...,20564,22044,21637
group D,malemalemalemalemalefemalefemalemalefemalefema...,high schoolassociate's degreehigh schoolsome c...,free/reducedstandardstandardstandardfree/reduc...,completednonenonenonecompletednonenonenonenone...,17649,18348,18378
group E,femalemalemalefemalemalemalefemalemalemalefema...,master's degreesome collegeassociate's degreea...,free/reducedstandardstandardfree/reducedstanda...,nonenonecompletednonenonecompletedcompletedcom...,10335,10224,9997

In [15]:
# sum()
groups.sum(numeric_only=True)

         math score  reading score  writing score
groups
group A        5485           5756           5578
group B       12056          12797          12464
group C       20564          22044          21637
group D       17649          18348          18378
group E       10335          10224           9997

In [19]:
# mean()
groups.mean(numeric_only=True)

         math score  reading score  writing score
groups
group A   61.629213      64.674157      62.674157
group B   63.452632      67.352632      65.600000
group C   64.463950      69.103448      67.827586
group D   67.362595      70.030534      70.145038
group E   73.821429      73.028571      71.407143

In [17]:
# max()
groups.max(numeric_only=True)

         math score  reading score  writing score
groups
group A         100            100             97
group B          97             97             96
group C          98            100            100
group D         100            100            100
group E         100            100            100

### Practice:

In [25]:
# Find that group which scored highest total in math.
groups['math score'].sum().sort_values(ascending=False).head(1)

groups
group C    20564
Name: math score, dtype: int64

In [28]:
# Find that group which scored highest avg in writing.
groups['writing score'].mean().sort_values(ascending=False).head(1)

groups
group E    71.407143
Name: writing score, dtype: float64

In [29]:
# find that parental level of education which has highest total in reading score.
data1.groupby('parental level of education')['reading score'].sum().sort_values(ascending=False).head(1)

parental level of education
associate's degree    15746
Name: reading score, dtype: int64

In [68]:
# find the highest math score of each group
groups['math score'].max()

groups
group A    100
group B     97
group C     98
group D    100
group E    100
Name: math score, dtype: int64

### groupby() attributes and Functions in Pandas:

 - groups
 - ngroups
 - len()
 - size()
 - indices
 - nunique()
 - dtypes
 - count()
 - first()
 - last()
 - head()
 - tail()
 - get_group()
 - describe()
 - apply()

In [35]:
# groups
data1.groupby('parental level of education').groups

{'associate's degree': [3, 5, 10, 11, 19, 35, 36, 38, 39, 40, 41, 42, 44, 45, 46, 48, 51, 56, 57, 62, 63, 68, 69, 72, 75, 80, 83, 87, 93, 95, 102, 107, 108, 110, 112, 121, 138, 147, 149, 152, 158, 159, 160, 173, 177, 183, 185, 190, 195, 200, 202, 203, 213, 216, 221, 224, 231, 235, 239, 245, 246, 256, 257, 268, 272, 285, 286, 290, 295, 297, 299, 302, 303, 304, 308, 310, 313, 317, 319, 328, 331, 332, 333, 337, 343, 349, 353, 356, 375, 380, 381, 387, 393, 397, 406, 407, 409, 412, 417, 420, ...], 'bachelor's degree': [0, 24, 27, 60, 77, 90, 99, 101, 114, 116, 117, 120, 129, 134, 135, 148, 151, 153, 165, 174, 189, 199, 206, 232, 234, 236, 241, 266, 270, 275, 279, 282, 288, 293, 311, 312, 314, 318, 334, 347, 350, 355, 365, 367, 374, 379, 386, 414, 416, 426, 455, 456, 458, 460, 464, 475, 476, 493, 507, 509, 522, 528, 535, 538, 551, 562, 564, 566, 569, 571, 582, 587, 592, 594, 595, 612, 616, 617, 621, 624, 632, 645, 667, 692, 697, 700, 702, 705, 740, 748, 757, 771, 773, 784, 809, 816, 817, 821, 831, 832, ...], 'high school': [8, 9, 12, 16, 20, 28, 47, 49, 53, 55, 81, 84, 91, 92, 103, 111, 115, 123, 125, 137, 143, 156, 163, 166, 168, 170, 176, 182, 186, 197, 207, 212, 214, 217, 218, 220, 227, 240, 242, 247, 248, 249, 254, 263, 264, 267, 277, 280, 281, 294, 298, 309, 315, 320, 321, 324, 330, 340, 341, 342, 345, 348, 360, 366, 388, 395, 396, 403, 404, 408, 415, 419, 421, 431, 432, 438, 441, 447, 448, 459, 467, 468, 471, 480, 483, 485, 494, 495, 506, 519, 524, 527, 534, 537, 540, 547, 548, 568, 573, 574, ...], 'master's degree': [2, 14, 18, 25, 29, 32, 79, 106, 128, 130, 162, 164, 167, 175, 178, 180, 194, 225, 253, 259, 316, 377, 382, 389, 410, 422, 478, 500, 504, 508, 514, 523, 544, 549, 557, 567, 579, 600, 604, 607, 618, 685, 713, 735, 752, 781, 789, 812, 845, 846, 850, 861, 892, 900, 901, 940, 941, 957, 995], 'some college': [1, 4, 6, 7, 13, 21, 22, 26, 30, 31, 33, 34, 43, 50, 52, 58, 67, 70, 71, 82, 85, 86, 88, 94, 97, 98, 100, 104, 105, 113, 119, 122, 124, 127, 132, 133, 139, 141, 142, 144, 145, 155, 157, 161, 169, 172, 181, 191, 193, 198, 201, 204, 208, 209, 211, 226, 229, 230, 238, 243, 251, 255, 258, 261, 269, 271, 273, 274, 283, 300, 305, 306, 322, 325, 326, 327, 335, 344, 346, 351, 352, 354, 357, 358, 359, 362, 364, 370, 371, 373, 385, 391, 392, 401, 402, 411, 418, 424, 425, 435, ...], 'some high school': [15, 17, 23, 37, 54, 59, 61, 64, 65, 66, 73, 74, 76, 78, 89, 96, 109, 118, 126, 131, 136, 140, 146, 150, 154, 171, 179, 184, 187, 188, 192, 196, 205, 210, 215, 219, 222, 223, 228, 233, 237, 244, 250, 252, 260, 262, 265, 276, 278, 284, 287, 289, 291, 292, 296, 301, 307, 323, 329, 336, 338, 339, 361, 363, 368, 369, 372, 376, 378, 383, 384, 390, 394, 398, 399, 400, 405, 413, 423, 427, 428, 429, 433, 434, 439, 442, 444, 445, 473, 488, 498, 505, 511, 512, 513, 515, 518, 526, 531, 545, ...]}

In [37]:
# ngroups
data1.groupby('parental level of education').ngroups

6

In [33]:
# len()
len(data1.groupby('parental level of education'))

6

In [40]:
# size()
data1.groupby('groups').size()

groups
group A     89
group B    190
group C    319
group D    262
group E    140
dtype: int64

In [17]:
# indices
groups.indices

{'group A': array([  3,  13,  14,  25,  46,  61,  62,  72,  77,  82,  88, 112, 129,
        143, 150, 151, 170, 228, 250, 296, 300, 305, 327, 356, 365, 368,
        378, 379, 384, 395, 401, 402, 423, 428, 433, 442, 444, 464, 467,
        468, 483, 489, 490, 506, 511, 539, 546, 571, 575, 576, 586, 589,
        591, 597, 614, 623, 635, 651, 653, 688, 697, 702, 705, 731, 741,
        769, 778, 805, 810, 811, 816, 820, 830, 832, 837, 851, 892, 902,
        911, 936, 943, 960, 966, 972, 974, 983, 985, 988, 994], dtype=int64),
 'group B': array([  0,   2,   5,   6,   7,   9,  12,  17,  21,  26,  31,  39,  42,
         43,  45,  65,  68,  75,  80,  81,  94,  96, 100, 103, 108, 109,
        116, 121, 125, 126, 136, 146, 152, 157, 158, 160, 162, 167, 168,
        176, 178, 188, 192, 198, 199, 203, 208, 209, 215, 218, 219, 221,
        224, 232, 238, 247, 248, 252, 258, 274, 279, 284, 285, 287, 288,
        295, 303, 308, 310, 311, 318, 329, 333, 335, 338, 342, 346, 350,
        355, 360, 361, 380, 396, 398, 406, 407, 413, 424, 443, 448, 449,
        459, 461, 474, 480, 484, 488, 494, 498, 501, 505, 507, 513, 514,
        519, 534, 551, 552, 558, 564, 565, 568, 570, 577, 578, 596, 609,
        621, 626, 631, 632, 636, 642, 644, 645, 648, 654, 655, 667, 675,
        681, 682, 684, 701, 704, 714, 715, 722, 724, 730, 737, 744, 749,
        759, 763, 765, 767, 770, 772, 774, 775, 776, 781, 782, 785, 787,
        790, 794, 803, 809, 815, 818, 823, 829, 833, 834, 838, 842, 843,
        855, 856, 858, 867, 870, 872, 882, 896, 897, 906, 914, 919, 923,
        944, 946, 948, 969, 976, 980, 982, 991], dtype=int64),
 'group C': array([  1,   4,  10,  15,  16,  18,  19,  23,  27,  28,  40,  41,  47,
         49,  52,  54,  55,  59,  63,  67,  69,  73,  74,  85,  86,  90,
         91,  92,  93,  95, 104, 105, 111, 115, 119, 120, 122, 131, 133,
        135, 138, 141, 145, 147, 155, 163, 165, 166, 169, 173, 174, 175,
        177, 180, 181, 184, 185, 189, 194, 196, 200, 202, 204, 211, 212,
        213, 217, 222, 226, 229, 231, 234, 239, 245, 249, 256, 257, 259,
        260, 261, 262, 266, 270, 271, 275, 276, 278, 290, 292, 298, 302,
        304, 307, 313, 314, 315, 317, 320, 322, 323, 324, 325, 326, 328,
        330, 331, 334, 337, 340, 341, 345, 347, 352, 353, 354, 357, 362,
        364, 366, 367, 371, 381, 382, 387, 393, 394, 397, 400, 404, 405,
        414, 416, 417, 420, 425, 426, 427, 429, 430, 431, 432, 434, 435,
        438, 440, 445, 447, 450, 452, 453, 454, 455, 460, 463, 465, 469,
        470, 471, 472, 482, 485, 487, 491, 492, 493, 496, 502, 508, 509,
        515, 521, 523, 524, 526, 527, 529, 530, 531, 535, 536, 540, 542,
        547, 548, 549, 550, 555, 556, 557, 561, 562, 572, 573, 585, 587,
        588, 590, 594, 595, 601, 605, 606, 607, 611, 612, 613, 615, 619,
        620, 622, 629, 633, 650, 656, 660, 661, 663, 665, 666, 668, 670,
        672, 673, 677, 683, 690, 692, 694, 696, 699, 707, 710, 716, 717,
        718, 720, 723, 729, 732, 735, 736, 739, 742, 743, 747, 748, 752,
        753, 754, 760, 766, 773, 777, 783, 784, 788, 789, 799, 800, 801,
        804, 808, 812, 814, 819, 824, 825, 826, 827, 831, 835, 839, 841,
        846, 848, 850, 854, 857, 859, 860, 863, 864, 866, 869, 871, 874,
        875, 877, 880, 885, 887, 901, 908, 912, 913, 917, 918, 921, 929,
        930, 933, 934, 940, 942, 945, 953, 954, 956, 959, 963, 967, 971,
        975, 977, 979, 984, 986, 996, 997], dtype=int64),
 'group D': array([  8,  11,  20,  22,  24,  29,  30,  33,  36,  37,  38,  48,  53,
         57,  58,  64,  66,  70,  71,  78,  84,  87,  89,  98,  99, 101,
        102, 106, 110, 113, 117, 118, 123, 127, 128, 130, 134, 139, 140,
        144, 148, 153, 154, 159, 172, 179, 183, 187, 191, 193, 195, 201,
        205, 210, 220, 223, 227, 230, 235, 236, 237, 240, 242, 244, 251,
        253, 254, 264, 265, 267, 268, 272, 273, 280, 281, 282, 283, 291,
        294, 299, 301, 309, 312, 316, 319, 336, 339, 343, 344, 348, 358,
        359, 363, 369, 372, 373, 374, 376, 377, 388, 389, 391, 399, 403,
        408, 409, 410, 412, 418, 421, 422, 436, 437, 439, 441, 446, 456,
        457, 466, 473, 475, 477, 478, 481, 486, 495, 497, 500, 504, 510,
        512, 516, 518, 520, 522, 528, 537, 541, 543, 544, 553, 559, 560,
        563, 567, 569, 579, 580, 582, 583, 584, 598, 599, 600, 603, 604,
        610, 617, 618, 625, 627, 628, 630, 634, 637, 639, 640, 641, 646,
        649, 652, 657, 658, 659, 662, 664, 669, 671, 674, 678, 679, 680,
        687, 693, 695, 698, 703, 706, 708, 709, 712, 713, 721, 728, 733,
        738, 740, 745, 746, 750, 756, 758, 761, 762, 764, 768, 771, 780,
        791, 792, 796, 806, 817, 821, 828, 840, 844, 847, 849, 862, 865,
        876, 878, 879, 883, 888, 889, 893, 898, 899, 900, 903, 904, 905,
        907, 910, 920, 922, 924, 927, 931, 932, 935, 938, 939, 941, 947,
        951, 957, 958, 961, 964, 965, 970, 973, 978, 981, 989, 992, 993,
        998, 999], dtype=int64),
 'group E': array([ 32,  34,  35,  44,  50,  51,  56,  60,  76,  79,  83,  97, 107,
        114, 124, 132, 137, 142, 149, 156, 161, 164, 171, 182, 186, 190,
        197, 206, 207, 214, 216, 225, 233, 241, 243, 246, 255, 263, 269,
        277, 286, 289, 293, 297, 306, 321, 332, 349, 351, 370, 375, 383,
        385, 386, 390, 392, 411, 415, 419, 451, 458, 462, 476, 479, 499,
        503, 517, 525, 532, 533, 538, 545, 554, 566, 574, 581, 592, 593,
        602, 608, 616, 624, 638, 643, 647, 676, 685, 686, 689, 691, 700,
        711, 719, 725, 726, 727, 734, 751, 755, 757, 779, 786, 793, 795,
        797, 798, 802, 807, 813, 822, 836, 845, 852, 853, 861, 868, 873,
        881, 884, 886, 890, 891, 894, 895, 909, 915, 916, 925, 926, 928,
        937, 949, 950, 952, 955, 962, 968, 987, 990, 995], dtype=int64)}

In [42]:
# nunique()
groups.nunique()

,gender,parental level of education,lunch,test preparation course,math score,reading score,writing score
groups,,,,,,,
group A,2,6,2,2,47,47,47
group B,2,6,2,2,59,58,60
group C,2,6,2,2,68,63,65
group D,2,6,2,2,61,56,60
group E,2,6,2,2,54,50,54

In [43]:
# dtypes
groups.dtypes

C:\Users\hp\AppData\Local\Temp\ipykernel_12736\1356931180.py:1: FutureWarning: DataFrameGroupBy.dtypes is deprecated and will be removed in a future version. Check the dtypes on the base object instead
  groups.dtypes

,gender,groups,parental level of education,lunch,test preparation course,math score,reading score,writing score
groups,,,,,,,,
group A,object,object,object,object,object,int64,int64,int64
group B,object,object,object,object,object,int64,int64,int64
group C,object,object,object,object,object,int64,int64,int64
group D,object,object,object,object,object,int64,int64,int64
group E,object,object,object,object,object,int64,int64,int64

In [44]:
groups.count()

,gender,parental level of education,lunch,test preparation course,math score,reading score,writing score
groups,,,,,,,
group A,89,89,89,89,89,89,89
group B,190,190,190,190,190,190,190
group C,319,319,319,319,319,319,319
group D,262,262,262,262,262,262,262
group E,140,140,140,140,140,140,140

In [45]:
# first() -> Returns the first row of each group.
groups.first()

,gender,parental level of education,lunch,test preparation course,math score,reading score,writing score
groups,,,,,,,
group A,male,associate's degree,free/reduced,none,47,57,44
group B,female,bachelor's degree,standard,none,72,72,74
group C,female,some college,standard,completed,69,90,88
group D,male,high school,free/reduced,completed,64,64,67
group E,female,master's degree,free/reduced,none,56,72,65

In [46]:
# last() -> Returns the last row of each group.
groups.last()

,gender,parental level of education,lunch,test preparation course,math score,reading score,writing score
groups,,,,,,,
group A,male,high school,standard,none,63,63,62
group B,female,some high school,standard,completed,65,82,78
group C,female,high school,free/reduced,completed,59,71,65
group D,female,some college,free/reduced,none,77,86,86
group E,female,master's degree,standard,completed,88,99,95

In [22]:
# head(n) -> Returns the first n rows from each group.
data1.groupby('parental level of education').head(2)

,gender,groups,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
5,female,group B,associate's degree,standard,none,71,83,78
8,male,group D,high school,free/reduced,completed,64,64,67
9,female,group B,high school,free/reduced,none,38,60,50
14,female,group A,master's degree,standard,none,50,53,58
15,female,group C,some high school,standard,none,69,75,78
17,female,group B,some high school,free/reduced,none,18,32,28
24,male,group D,bachelor's degree,free/reduced,completed,74,71,80

In [23]:
# tail(n) -> Returns the last n rows from each group.
data1.groupby('parental level of education').tail(2)

,gender,groups,parental level of education,lunch,test preparation course,math score,reading score,writing score
957,female,group D,master's degree,standard,none,92,100,100
970,female,group D,bachelor's degree,standard,none,89,100,100
986,female,group C,associate's degree,standard,none,40,59,51
988,female,group A,some high school,free/reduced,none,44,45,45
991,female,group B,some high school,standard,completed,65,82,78
992,female,group D,associate's degree,free/reduced,none,55,76,76
993,female,group D,bachelor's degree,free/reduced,none,62,72,74
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86

In [51]:
# sample()
groups.sample()

,gender,groups,parental level of education,lunch,test preparation course,math score,reading score,writing score
653,female,group A,associate's degree,standard,completed,65,70,74
867,male,group B,associate's degree,standard,none,61,42,41
469,male,group C,some college,standard,none,91,74,76
512,male,group D,some high school,free/reduced,none,62,49,52
525,male,group E,some college,standard,none,68,60,59

In [52]:
# describe()
groups.describe()

        math score                                                        \
             count       mean        std   min    25%   50%   75%    max
groups
group A       89.0  61.629213  14.523008  28.0  51.00  61.0  71.0  100.0
group B      190.0  63.452632  15.468191   8.0  54.00  63.0  74.0   97.0
group C      319.0  64.463950  14.852666   0.0  55.00  65.0  74.0   98.0
group D      262.0  67.362595  13.769386  26.0  59.00  69.0  77.0  100.0
group E      140.0  73.821429  15.534259  30.0  64.75  74.5  85.0  100.0

        reading score             ...               writing score             \
                count       mean  ...    75%    max         count       mean
groups                            ...
group A          89.0  64.674157  ...  74.00  100.0          89.0  62.674157
group B         190.0  67.352632  ...  79.75   97.0         190.0  65.600000
group C         319.0  69.103448  ...  78.50  100.0         319.0  67.827586
group D         262.0  70.030534  ...  79.00  100.0         262.0  70.145038
group E         140.0  73.028571  ...  84.00  100.0         140.0  71.407143


               std   min    25%   50%    75%    max
groups
group A  15.468278  19.0  51.00  62.0  73.00   97.0
group B  15.625173  15.0  55.25  67.0  78.00   96.0
group C  14.983378  10.0  57.00  68.0  79.00  100.0
group D  14.367707  32.0  61.00  72.0  80.00  100.0
group E  15.113906  22.0  62.00  72.0  80.25  100.0

[5 rows x 24 columns]

In [53]:
# get_group()
groups.get_group('group A')

,gender,groups,parental level of education,lunch,test preparation course,math score,reading score,writing score
3,male,group A,associate's degree,free/reduced,none,47,57,44
13,male,group A,some college,standard,completed,78,72,70
14,female,group A,master's degree,standard,none,50,53,58
25,male,group A,master's degree,free/reduced,none,73,74,72
46,female,group A,associate's degree,standard,completed,55,65,62
...,...,...,...,...,...,...,...,...
974,female,group A,some college,standard,none,54,63,67
983,female,group A,some college,standard,completed,78,87,91
985,male,group A,high school,standard,none,57,51,54
988,female,group A,some high school,free/reduced,none,44,45,45
994,male,group A,high school,standard,none,63,63,62

### Custom aggregation

In [55]:
# agg() -> using dict
groups.agg(
    {
        'math score':'mean',
        'reading score':'max',
        'writing score':'sum',
    }
)

         math score  reading score  writing score
groups
group A   61.629213            100           5578
group B   63.452632             97          12464
group C   64.463950            100          21637
group D   67.362595            100          18378
group E   73.821429            100           9997

### Named aggregation

In [57]:
# agg() -> using list (defining multiple aggregation operations at once for all the columns of group)
groups.agg(['min','max','count'])

         gender             parental level of education                    \
            min   max count                         min               max
groups
group A  female  male    89          associate's degree  some high school
group B  female  male   190          associate's degree  some high school
group C  female  male   319          associate's degree  some high school
group D  female  male   262          associate's degree  some high school
group E  female  male   140          associate's degree  some high school

                      lunch                 test preparation course  ...  \
        count           min       max count                     min  ...
groups                                                               ...
group A    89  free/reduced  standard    89               completed  ...
group B   190  free/reduced  standard   190               completed  ...
group C   319  free/reduced  standard   319               completed  ...
group D   262  free/reduced  standard   262               completed  ...
group E   140  free/reduced  standard   140               completed  ...

              math score            reading score            writing score  \
        count        min  max count           min  max count           min
groups
group A    89         28  100    89            23  100    89            19
group B   190          8   97   190            24   97   190            15
group C   319          0   98   319            17  100   319            10
group D   262         26  100   262            31  100   262            32
group E   140         30  100   140            26  100   140            22


         max count
groups
group A   97    89
group B   96   190
group C  100   319
group D  100   262
group E  100   140

[5 rows x 21 columns]

In [62]:
# Adding both the syntax
groups.agg(
    {
        'math score':['mean','min'],
        'reading score':['std','max'],
        'writing score':['sum','max']
    }
)

        math score     reading score      writing score
              mean min           std  max           sum  max
groups
group A  61.629213  28     15.543762  100          5578   97
group B  63.452632   8     15.177499   97         12464   96
group C  64.463950   0     13.997033  100         21637  100
group D  67.362595  26     13.895306  100         18378  100
group E  73.821429  30     14.874024  100          9997  100

### apply()

In [63]:
# apply -> builtin function

groups.apply(min)

C:\Users\hp\AppData\Local\Temp\ipykernel_12736\1093413248.py:3: FutureWarning: The provided callable <built-in function min> is currently using np.minimum.reduce. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string np.minimum.reduce instead.
  groups.apply(min)
C:\Users\hp\AppData\Local\Temp\ipykernel_12736\1093413248.py:3: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  groups.apply(min)

,gender,groups,parental level of education,lunch,test preparation course,math score,reading score,writing score
groups,,,,,,,,
group A,female,group A,associate's degree,free/reduced,completed,28,23,19
group B,female,group B,associate's degree,free/reduced,completed,8,24,15
group C,female,group C,associate's degree,free/reduced,completed,0,17,10
group D,female,group D,associate's degree,free/reduced,completed,26,31,32
group E,female,group E,associate's degree,free/reduced,completed,30,26,22

In [85]:
# finds the maximum math score of female students whose test preparation course is completed.

def max_func(group):
  res = group[(group['test preparation course'] == 'completed') & (group['gender']=='female')]
  return res['math score'].max()

In [86]:
# apply()
groups.apply(max_func)

C:\Users\hp\AppData\Local\Temp\ipykernel_12736\561046007.py:1: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  groups.apply(max_func)

groups
group A    92
group B    94
group C    96
group D    97
group E    99
dtype: int64

### Looping on groups.

In [88]:
# looping on groups

for group,data in groups:
  print(group,data)

group A      gender   groups parental level of education         lunch  \
3      male  group A          associate's degree  free/reduced
13     male  group A                some college      standard
14   female  group A             master's degree      standard
25     male  group A             master's degree  free/reduced
46   female  group A          associate's degree      standard
..      ...      ...                         ...           ...
974  female  group A                some college      standard
983  female  group A                some college      standard
985    male  group A                 high school      standard
988  female  group A            some high school  free/reduced
994    male  group A                 high school      standard

    test preparation course  math score  reading score  writing score
3                      none          47             57             44
13                completed          78             72             70
14                     none          50             53             58
25                     none          73             74             72
46                completed          55             65             62
..                      ...         ...            ...            ...
974                    none          54             63             67
983               completed          78             87             91
985                    none          57             51             54
988                    none          44             45             45
994                    none          63             63             62

[89 rows x 8 columns]
group B      gender   groups parental level of education         lunch  \
0    female  group B           bachelor's degree      standard
2    female  group B             master's degree      standard
5    female  group B          associate's degree      standard
6    female  group B                some college      standard
7      male  group B                some college  free/reduced
..      ...      ...                         ...           ...
969  female  group B           bachelor's degree      standard
976    male  group B                some college  free/reduced
980  female  group B                 high school  free/reduced
982    male  group B            some high school      standard
991  female  group B            some high school      standard

    test preparation course  math score  reading score  writing score
0                      none          72             72             74
2                      none          90             95             93
5                      none          71             83             78
6                 completed          88             95             92
7                      none          40             43             39
..                      ...         ...            ...            ...
969                    none          75             84             80
976               completed          60             62             60
980                    none           8             24             23
982               completed          79             85             86
991               completed          65             82             78

[190 rows x 8 columns]
group C      gender   groups parental level of education         lunch  \
1    female  group C                some college      standard
4      male  group C                some college      standard
10     male  group C          associate's degree      standard
15   female  group C            some high school      standard
16     male  group C                 high school      standard
..      ...      ...                         ...           ...
979  female  group C          associate's degree      standard
984  female  group C            some high school      standard
986  female  group C          associate's degree      standard
996    male  group C                 high school  free/reduced
997  female  group C                 high school  free/reduced

    test preparation course  math score  reading score  writing score
1                 completed          69             90             88
4                      none          76             78             75
10                     none          58             54             52
15                     none          69             75             78
16                     none          88             89             86
..                      ...         ...            ...            ...
979                    none          91             95             94
984                    none          74             75             82
986                    none          40             59             51
996                    none          62             55             55
997               completed          59             71             65

[319 rows x 8 columns]
group D      gender   groups parental level of education         lunch  \
8      male  group D                 high school  free/reduced
11     male  group D          associate's degree      standard
20     male  group D                 high school      standard
22     male  group D                some college      standard
24     male  group D           bachelor's degree  free/reduced
..      ...      ...                         ...           ...
989  female  group D                some college  free/reduced
992  female  group D          associate's degree  free/reduced
993  female  group D           bachelor's degree  free/reduced
998  female  group D                some college      standard
999  female  group D                some college  free/reduced

    test preparation course  math score  reading score  writing score
8                 completed          64             64             67
11                     none          40             52             43
20                     none          66             69             63
22                     none          44             54             53
24                completed          74             71             80
..                      ...         ...            ...            ...
989               completed          67             86             83
992                    none          55             76             76
993                    none          62             72             74
998               completed          68             78             77
999                    none          77             86             86

[262 rows x 8 columns]
group E      gender   groups parental level of education         lunch  \
32   female  group E             master's degree  free/reduced
34     male  group E                some college      standard
35     male  group E          associate's degree      standard
44   female  group E          associate's degree  free/reduced
50     male  group E                some college      standard
..      ...      ...                         ...           ...
962  female  group E          associate's degree      standard
968  female  group E          associate's degree      standard
987    male  group E            some high school      standard
990    male  group E                 high school  free/reduced
995  female  group E             master's degree      standard

    test preparation course  math score  reading score  writing score
32                     none          56             72             65
34                     none          97             87             82
35                completed          81             81             79
44                     none          50             56             54
50                     none          53             55             48
..                      ...         ...            ...            ...
962                    none         100            100            100
968                    none          68             76             67
987               completed          81             75             76
990               completed          86             81             75
995               completed          88             99             95

[140 rows x 8 columns]

In [101]:
for group,data in groups:
    if group == 'group A':
        data['test preparation course'] += ' course'
    print(data)

     gender   groups parental level of education         lunch  \
3      male  group A          associate's degree  free/reduced
13     male  group A                some college      standard
14   female  group A             master's degree      standard
25     male  group A             master's degree  free/reduced
46   female  group A          associate's degree      standard
..      ...      ...                         ...           ...
974  female  group A                some college      standard
983  female  group A                some college      standard
985    male  group A                 high school      standard
988  female  group A            some high school  free/reduced
994    male  group A                 high school      standard

    test preparation course  math score  reading score  writing score
3               none course          47             57             44
13         completed course          78             72             70
14              none course          50             53             58
25              none course          73             74             72
46         completed course          55             65             62
..                      ...         ...            ...            ...
974             none course          54             63             67
983        completed course          78             87             91
985             none course          57             51             54
988             none course          44             45             45
994             none course          63             63             62

[89 rows x 8 columns]
     gender   groups parental level of education         lunch  \
0    female  group B           bachelor's degree      standard
2    female  group B             master's degree      standard
5    female  group B          associate's degree      standard
6    female  group B                some college      standard
7      male  group B                some college  free/reduced
..      ...      ...                         ...           ...
969  female  group B           bachelor's degree      standard
976    male  group B                some college  free/reduced
980  female  group B                 high school  free/reduced
982    male  group B            some high school      standard
991  female  group B            some high school      standard

    test preparation course  math score  reading score  writing score
0                      none          72             72             74
2                      none          90             95             93
5                      none          71             83             78
6                 completed          88             95             92
7                      none          40             43             39
..                      ...         ...            ...            ...
969                    none          75             84             80
976               completed          60             62             60
980                    none           8             24             23
982               completed          79             85             86
991               completed          65             82             78

[190 rows x 8 columns]
     gender   groups parental level of education         lunch  \
1    female  group C                some college      standard
4      male  group C                some college      standard
10     male  group C          associate's degree      standard
15   female  group C            some high school      standard
16     male  group C                 high school      standard
..      ...      ...                         ...           ...
979  female  group C          associate's degree      standard
984  female  group C            some high school      standard
986  female  group C          associate's degree      standard
996    male  group C                 high school  free/reduced
997  female  group C                 high school  free/reduced

    test preparation course  math score  reading score  writing score
1                 completed          69             90             88
4                      none          76             78             75
10                     none          58             54             52
15                     none          69             75             78
16                     none          88             89             86
..                      ...         ...            ...            ...
979                    none          91             95             94
984                    none          74             75             82
986                    none          40             59             51
996                    none          62             55             55
997               completed          59             71             65

[319 rows x 8 columns]
     gender   groups parental level of education         lunch  \
8      male  group D                 high school  free/reduced
11     male  group D          associate's degree      standard
20     male  group D                 high school      standard
22     male  group D                some college      standard
24     male  group D           bachelor's degree  free/reduced
..      ...      ...                         ...           ...
989  female  group D                some college  free/reduced
992  female  group D          associate's degree  free/reduced
993  female  group D           bachelor's degree  free/reduced
998  female  group D                some college      standard
999  female  group D                some college  free/reduced

    test preparation course  math score  reading score  writing score
8                 completed          64             64             67
11                     none          40             52             43
20                     none          66             69             63
22                     none          44             54             53
24                completed          74             71             80
..                      ...         ...            ...            ...
989               completed          67             86             83
992                    none          55             76             76
993                    none          62             72             74
998               completed          68             78             77
999                    none          77             86             86

[262 rows x 8 columns]
     gender   groups parental level of education         lunch  \
32   female  group E             master's degree  free/reduced
34     male  group E                some college      standard
35     male  group E          associate's degree      standard
44   female  group E          associate's degree  free/reduced
50     male  group E                some college      standard
..      ...      ...                         ...           ...
962  female  group E          associate's degree      standard
968  female  group E          associate's degree      standard
987    male  group E            some high school      standard
990    male  group E                 high school  free/reduced
995  female  group E             master's degree      standard

    test preparation course  math score  reading score  writing score
32                     none          56             72             65
34                     none          97             87             82
35                completed          81             81             79
44                     none          50             56             54
50                     none          53             55             48
..                      ...         ...            ...            ...
962                    none         100            100            100
968                    none          68             76             67
987               completed          81             75             76
990               completed          86             81             75
995               completed          88             99             95

[140 rows x 8 columns]

### groupby on multiple cols

In [106]:
# groupby on multiple cols
two_groups = data1.groupby(['groups','gender'])
two_groups

In [109]:
two_groups.mean(numeric_only=True)

                math score  reading score  writing score
groups  gender
group A female   58.527778      69.000000      67.861111
        male     63.735849      61.735849      59.150943
group B female   61.403846      71.076923      70.048077
        male     65.930233      62.848837      60.220930
group C female   62.033333      71.944444      71.777778
        male     67.611511      65.424460      62.712230
group D female   65.248062      74.046512      75.023256
        male     69.413534      66.135338      65.413534
group E female   70.811594      75.840580      75.536232
        male     76.746479      70.295775      67.394366

In [110]:
two_groups['math score'].sum().sort_values(ascending=False).head(1)

groups   gender
group C  female    11166
Name: math score, dtype: int64

In [112]:
# agg on multiple groupby
two_groups.agg(['min','max'])

               parental level of education                           lunch  \
                                       min               max           min
groups  gender
group A female          associate's degree  some high school  free/reduced
        male            associate's degree  some high school  free/reduced
group B female          associate's degree  some high school  free/reduced
        male            associate's degree  some high school  free/reduced
group C female          associate's degree  some high school  free/reduced
        male            associate's degree  some high school  free/reduced
group D female          associate's degree  some high school  free/reduced
        male            associate's degree  some high school  free/reduced
group E female          associate's degree  some high school  free/reduced
        male            associate's degree  some high school  free/reduced

                         test preparation course       math score       \
                     max                     min   max        min  max
groups  gender
group A female  standard               completed  none         34   92
        male    standard               completed  none         28  100
group B female  standard               completed  none          8   97
        male    standard               completed  none         30   94
group C female  standard               completed  none          0   96
        male    standard               completed  none         27   98
group D female  standard               completed  none         26   98
        male    standard               completed  none         39  100
group E female  standard               completed  none         32  100
        male    standard               completed  none         30  100

               reading score      writing score
                         min  max           min  max
groups  gender
group A female            43  100            41   97
        male              23   96            19   92
group B female            24   97            23   96
        male              24   96            15   92
group C female            17  100            10  100
        male              28  100            27   95
group D female            31  100            32  100
        male              34   97            34   99
group E female            34  100            38  100
        male              26  100            22  100

### Excercise

# Merging in pandas.

1. pd.concat()
2. df1.merge(df2)

In [ ]:
d1 = pd.read_csv("course_info_1.csv")

In [12]:
d1.head(4)

   course_id course_name
0       1001      python
1       1002         C++
2       1003           C
3       1004        Java

In [ ]:
d2 = pd.read_csv("course_info_2.csv")

In [14]:
d2.head(4)

   course_id course_name
0       1015        HTML
1       1016         CSS
2       1017  Javascript
3       1018         PHP

In [17]:
# concat()
ans = pd.concat([d1,d2])
ans

    course_id         course_name
0        1001              python
1        1002                 C++
2        1003                   C
3        1004                Java
4        1005               Flask
5        1006              Django
6        1007                 SQL
7        1008                MERN
8        1009                 AWS
9        1010                 API
10       1011           Reasoning
11       1012                 DSA
12       1013        Data Science
13       1014               NoSql
0        1015                HTML
1        1016                 CSS
2        1017          Javascript
3        1018                 PHP
4        1019             MongoDB
5        1020               MYsql
6        1021             English
7        1022  Applied Mathmatics
8        1023       Deep learning
9        1024               Numpy
10       1025              Pandas
11       1026          Matplotlib
12       1027             Seaborn

In [18]:
# ignore_index
ans1 = pd.concat([d1,d2],ignore_index=True)
ans1

    course_id         course_name
0        1001              python
1        1002                 C++
2        1003                   C
3        1004                Java
4        1005               Flask
5        1006              Django
6        1007                 SQL
7        1008                MERN
8        1009                 AWS
9        1010                 API
10       1011           Reasoning
11       1012                 DSA
12       1013        Data Science
13       1014               NoSql
14       1015                HTML
15       1016                 CSS
16       1017          Javascript
17       1018                 PHP
18       1019             MongoDB
19       1020               MYsql
20       1021             English
21       1022  Applied Mathmatics
22       1023       Deep learning
23       1024               Numpy
24       1025              Pandas
25       1026          Matplotlib
26       1027             Seaborn

### -> merge()
1. left join
2. right join
3. inner join
4. outer join

In [ ]:
course_fees = pd.read_csv("course_fees.csv")

In [31]:
course_fees.head()

   course_id  fees  course_enrollment
0       1001  8000               65.0
1       1002  7000               43.0
2       1003    45                NaN
3       1004  3000               25.0
4       1005  4500               84.0

In [ ]:
course_info_1 = pd.read_csv("course_info_1.csv")

In [34]:
course_info_1.head()

   course_id course_name
0       1001      python
1       1002         C++
2       1003           C
3       1004        Java
4       1005       Flask

In [35]:
# left join
course_info_1.merge(course_fees,how="left",on="course_id")

    course_id   course_name     fees  course_enrollment
0        1001        python   8000.0               65.0
1        1002           C++   7000.0               43.0
2        1003             C     45.0                NaN
3        1004          Java   3000.0               25.0
4        1005         Flask   4500.0               84.0
5        1006        Django   6500.0               26.0
6        1007           SQL   7550.0               16.0
7        1008          MERN   2500.0               25.0
8        1009           AWS  23400.0               45.0
9        1010           API   3900.0               84.0
10       1011     Reasoning  12000.0               64.0
11       1012           DSA  15000.0               76.0
12       1013  Data Science  25000.0               45.0
13       1014         NoSql   4500.0               10.0
14       2000      power BI      NaN                NaN
15       2001       tableau      NaN                NaN

In [36]:
# right join
course_info_1.merge(course_fees,how="right",on="course_id")

    course_id   course_name   fees  course_enrollment
0        1001        python   8000               65.0
1        1002           C++   7000               43.0
2        1003             C     45                NaN
3        1004          Java   3000               25.0
4        1005         Flask   4500               84.0
5        1006        Django   6500               26.0
6        1007           SQL   7550               16.0
7        1008          MERN   2500               25.0
8        1009           AWS  23400               45.0
9        1010           API   3900               84.0
10       1011     Reasoning  12000               64.0
11       1012           DSA  15000               76.0
12       1013  Data Science  25000               45.0
13       1014         NoSql   4500               10.0
14       5000           NaN   9800                5.0
15       5001           NaN   6700                2.0

In [37]:
# outer join
course_info_1.merge(course_fees,how="outer",on="course_id")

    course_id   course_name     fees  course_enrollment
0        1001        python   8000.0               65.0
1        1002           C++   7000.0               43.0
2        1003             C     45.0                NaN
3        1004          Java   3000.0               25.0
4        1005         Flask   4500.0               84.0
5        1006        Django   6500.0               26.0
6        1007           SQL   7550.0               16.0
7        1008          MERN   2500.0               25.0
8        1009           AWS  23400.0               45.0
9        1010           API   3900.0               84.0
10       1011     Reasoning  12000.0               64.0
11       1012           DSA  15000.0               76.0
12       1013  Data Science  25000.0               45.0
13       1014         NoSql   4500.0               10.0
14       2000      power BI      NaN                NaN
15       2001       tableau      NaN                NaN
16       5000           NaN   9800.0                5.0
17       5001           NaN   6700.0                2.0

In [38]:
# inner join
course_info_1.merge(course_fees,how="inner",on="course_id")

    course_id   course_name   fees  course_enrollment
0        1001        python   8000               65.0
1        1002           C++   7000               43.0
2        1003             C     45                NaN
3        1004          Java   3000               25.0
4        1005         Flask   4500               84.0
5        1006        Django   6500               26.0
6        1007           SQL   7550               16.0
7        1008          MERN   2500               25.0
8        1009           AWS  23400               45.0
9        1010           API   3900               84.0
10       1011     Reasoning  12000               64.0
11       1012           DSA  15000               76.0
12       1013  Data Science  25000               45.0
13       1014         NoSql   4500               10.0

In [ ]:
# self join

In [40]:
# Alternate syntax of merging

pd.merge(course_info_1,course_fees,how="inner",on='course_id')

    course_id   course_name   fees  course_enrollment
0        1001        python   8000               65.0
1        1002           C++   7000               43.0
2        1003             C     45                NaN
3        1004          Java   3000               25.0
4        1005         Flask   4500               84.0
5        1006        Django   6500               26.0
6        1007           SQL   7550               16.0
7        1008          MERN   2500               25.0
8        1009           AWS  23400               45.0
9        1010           API   3900               84.0
10       1011     Reasoning  12000               64.0
11       1012           DSA  15000               76.0
12       1013  Data Science  25000               45.0
13       1014         NoSql   4500               10.0